Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Use the `received` method on `uppercase` channel to check the messages produced by the application.
ja_jp: アプリケーションによって生成されたメッセージを確認するには、`uppercase` チャネルの `received` メソッドを使用します。

source: Use the `received` method on `words-out` in-memory channel to check the message produced by the application.
ja_jp: アプリケーションによって生成されたメッセージを確認するには、`words-out` in-memory チャネルの `received` メソッドを使用します。

source: Use the `send` method to send a message to the `orders` channel. The application will process this message and send a message to `beverages` channel.
ja_jp: `send` メソッドを使用して、 `orders` チャンネルにメッセージを送信します。アプリケーションはこのメッセージを処理し、 `beverages` チャンネルにメッセージを送信します。

source: Use the `send` mwthod on `words-in` in-memory channel to send a message. The application will process this message and send a message to `uppercase` channel.
ja_jp: メッセージを送信するには、`words-in` in-memory チャネルの `send` メソッドを使用します。 アプリケーションはこのメッセージを処理し、`uppercase` チャネルにメッセージを送信します。

source: Use the `tableDataPageBuilder`.
ja_jp: `tableDataPageBuilder` を使用します。

source: Use the `team` parameter to refer to the workspace you chose during the Slack OIDC application registration.
ja_jp: Slack OIDC アプリケーションの登録時に選択したワークスペースを参照するには、 `team` パラメーターを使用します。

source: Use the `tls-config-1` TLS configuration for the HTTP server TLS communication.
ja_jp: HTTP サーバー TLS 通信には、`tls-config-1` TLS 設定を使用します。

source: Use the `urlbase` template parameter to reference full-page templates for your extension
ja_jp: エクステンションのフルページテンプレートを参照するには、 `urlbase` templateパラメータを使用します。

source: Use the `webComponentPageBuilder`.
ja_jp: `webComponentPageBuilder` を使用します。

source: Use the `wss` protocol to enforce encrypted HTTP connection via TLS.
ja_jp: TLS 経由で暗号化された HTTP 接続を強制するには、 `wss` プロトコルを使用します。

source: Use the `{urlbase}` template parameter to reference this folder in `embedded.html`:
ja_jp: `embedded.html` でこのフォルダを参照するには、 `{urlbase}` のテンプレートパラメータを使用します:

source: Use the actionBuilder to create a new Action.
ja_jp: actionBuilder を使用して新しいアクションを作成します。

source: Use the assistant page builder.
ja_jp: アシスタントページビルダーを使用します。

source: Use the bean in an observer of the `StartupEvent` - normal scoped beans must be used as described in <<lazy_by_default>>:
ja_jp: `StartupEvent` のオブザーバーで Bean を使用します - <<lazy_by_default>> で説明されているように、通常のスコープ Bean を使用する必要があります。

source: Use the browser
ja_jp: ブラウザーの使用

source: Use the builder
ja_jp: ビルダーの使用

source: Use the builder to configure the action.
ja_jp: ビルダーを使用してアクションを設定します。

source: Use the class name (without the package) plus the method.
ja_jp: (パッケージを含まない)クラス名とメソッドを使用します。

source: Use the class name plus the method name.
ja_jp: クラス名とメソッド名を使用します。

source: Use the command below, to delete an increment given its key.
ja_jp: インクリメントのキーを指定して削除するには、以下のコマンドを使用します。

source: Use the connection to send messages, if needed.
ja_jp: 必要に応じて、接続を使用してメッセージを送信します。

source: Use the created `commands` to associate the field `field` with the value `value`
ja_jp: 作成した `commands` を使用して、フィールド `field` と値 `value` を関連付けます。

source: Use the created `commands` to retrieve the field `field` value.
ja_jp: 作成した `commands` を使用して、フィールド `field` の値を取得します。

source: Use the database store to persist job related information so that they can be shared between nodes
ja_jp: データベースストアを使用してジョブ関連情報を永続化し、ノード間で共有できるようにします

source: Use the default `gcloud` configuration
ja_jp: デフォルトの `gcloud` 設定を使用します。

source: Use the default converter (built in or a custom converter) to convert `Level.class` enum.
ja_jp: `Level.class` enum を変換するには、デフォルトのコンバータ（内蔵またはカスタムコンバータ）を使用します。

source: Use the default tenant for all other paths. It is equivalent to removing the `tenant-id` attribute.
ja_jp: 他のすべてのパスにはデフォルトのテナントを使用します。これは、`tenant-id` 属性を削除するのと同じです。

source: Use the docker image from the file `native-builder.image`.
ja_jp: ファイル `native-builder.image` からDocker イメージを使用します。

source: Use the duplicated context in virtual threads
ja_jp: 仮想スレッドで複製されたコンテキストの使用

source: Use the file name as a unique id for the section.
ja_jp: ファイル名をセクションのユニークIDとして使用します。

source: Use the filename as the ID for the document.
ja_jp: ファイル名をドキュメントのIDとして使用します。

source: Use the filename syntax of`<category>-<titlekeyword>-<titlekeyword>-<content-type>.adoc`. For example, `security-basic-authentication-tutorial.adoc`.
ja_jp: ファイル名の構文は、<category>-<titlekeyword>-<titlekeyword>-<content-type>.adoc` を使用してください。例えば、 `security-basic-authentication-tutorial.adoc` です。

source: Use the filename syntax of`<category>-<titlekeyword>-<titlekeyword>.adoc`. For example, `security-basic-authentication.adoc`.
ja_jp: ファイル名の構文は `<category> -<titlekeyword> -<titlekeyword> .adoc`。たとえば、 `security-basic-authentication.adoc` です。

source: Use the first non-parameterless constructor If no annotations are found.
ja_jp: 最初に見つかった非パラメーターなしのコンストラクターを使用します。アノテーションが見つからない場合です。

source: Use the following Maven command to create a Quarkus REST (formerly RESTEasy Reactive) application that can be secured with the Quarkus OIDC extension.
ja_jp: 次の Maven コマンドを使用して、Quarkus OIDC エクステンションを使用して保護できる Quarkus REST (旧称 RESTEasy Reactive) アプリケーションを作成します。

source: Use the following command to recursively delete the `com.apple.quarantine` extended attribute on the GraalVM install directory as a workaround:
ja_jp: 回避策として、次のコマンドを使用して、GraalVMインストールディレクトリ上の `com.apple.quarantine` 拡張属性を再帰的に削除します:

source: Use the following example to start the PostgreSQL server:
ja_jp: 下記の例のように、PostgreSQL サーバーを起動します:

source: Use the following example to store roles inside another Jakarta Persistence entity:
ja_jp: 以下の例を使用して、ロールを別のJakarta Persistenceエンティティ内に格納します:

source: Use the following information to help you to decide which authentication mechanism to use to secure your Quarkus applications:
ja_jp: Quarkusアプリケーションを保護するためにどの認証メカニズムを使用するかを決定する際に、次の情報を使用してください:

source: Use the following information to select the appropriate token authentication mechanism to secure your Quarkus applications.
ja_jp: 次の情報を使用して、Quarkus アプリケーションを保護するために適切なトークン認証メカニズムを選択して下さい。

source: Use the following key points to find the right balance for securing your Quarkus applications.
ja_jp: Quarkus アプリケーションを保護するための適切なバランスを見つけるには、次の重要な点を使用します。

source: Use the following sample to store roles inside another entity:
ja_jp: 次のサンプルを使用して、別のエンティティ内にロールを格納します:

source: Use the generated importmap
ja_jp: 生成された importmap を使用する

source: Use the generated service interface based on Mutiny API.
ja_jp: Mutiny APIに基づいて生成されたサービスインターフェースを使用します。

source: Use the global `MeterRegistry`:
ja_jp: グローバル `MeterRegistry` を使用します。

source: Use the help option to display options for creating projects:
ja_jp: プロジェクトを作成するためのオプションを表示するには、help オプションを使用します:

source: Use the injected REST client to access GitHub API and request the private user emails
ja_jp: 注入された REST クライアントを使用して GitHub API にアクセスし、プライベートなユーザーメールを要求します。

source: Use the injected `Service` during rendering.
ja_jp: レンダリング時に注入された `Service` を使用します。

source: Use the injected application bean to call `sendMessage` method to send a message using the emitter with the channel `words-out`.
ja_jp: 注入されたアプリケーション Bean を使用して `sendMessage` メソッドを呼び出し、チャネル `words-out` を持つエミッターを使用してメッセージを送信します。

source: Use the managed HTTP server
ja_jp: 管理されたHTTPサーバーの使用

source: Use the managed Vert.x instance
ja_jp: 管理された Vert.x インスタンスの使用

source: Use the method name.
ja_jp: メソッド名を使用します。

source: Use the previously created `MockAuthorizationServerTestResource` as a Quarkus test resource.
ja_jp: 以前に作成した `MockAuthorizationServerTestResource` をQuarkusのテストリソースとして使用します。

source: Use the replication Mode
ja_jp: レプリケーション・モードの使用

source: Use the resolved configuration to create a builder and update it as required.
ja_jp: 解決された設定を使用してビルダーを作成し、必要に応じて更新します。

source: Use the roles associated with the access token, which are checked by default
ja_jp: デフォルトでチェックされるアクセストークンに関連付けられたロールの使用

source: Use the same token to call `/frontend/admin-name-with-propagated-token`. In contrast to the preceding command, this command returns `403` because `alice` has only a `user` role:
ja_jp: 同じトークンを使用して `/frontend/admin-name-with-propagated-token` を呼び出します。前のコマンドとは対照的に、このコマンドは `alice` に `user` ロールしかないため `403` を返します。

source: Use the same token to call `/frontend/admin-name-with-propagated-token`. This command also returns the `200` status code and the name `admin` because `admin` has both `user` and `admin` roles:
ja_jp: 同じトークンを使用して、 `/frontend/admin-name-with-propagated-token` を呼び出します。このコマンドは、 `admin` に `user` と `admin` の両方のロールがあるため、 `200` ステータスコードと名前 `admin` も返します。

source: Use the summary to provide a concise (26 words or less) description of the document. The value of this attribute is used in tiles or other descriptions on the website and is not required in newer diataxis-styled docs, as outlined in <<abstracts-preamble>>. If not present, the first sentence of the abstract is automatically used to generate the tile summary.
ja_jp: サマリーは、ドキュメントの簡潔な（26語以下の）説明を提供するために使用します。この属性の値は、ウェブサイト上のタイルやその他の説明で使用され、<<abstracts-preamble>> で概説したように、より新しい diataxis スタイルのドキュメントでは必要ありません。存在しない場合、要約の最初の文がタイルのサマリーを生成するために自動的に使用されます。

source: Use the summary to provide a concise (26 words or less) description of the document. The value of this attribute is used in tiles or other descriptions on the website and is not required in newer diataxis-styled docs, as outlined in xref:abstracts-preamble[Abstracts (preamble)]. If not present, the first sentence of the abstract is automatically used to generate the tile summary.
ja_jp: サマリーは、ドキュメントの簡潔な（26語以下の）説明を提供するために使用します。この属性の値は、ウェブサイト上のタイルやその他の説明で使用され、 link:#abstracts-preamble[要約(preamble)] で概説したように、より新しいdiataxisスタイルのドキュメントでは必要ありません。存在しない場合、要約の最初の文がタイルのサマリーを生成するために自動的に使用されます。

source: Use the username in the decrypted token and the tenant ID to generate the service expired page response.
ja_jp: 復号化されたトークン内のユーザー名とテナント ID を使用して、サービス期限切れページのレスポンスを生成します。

source: Use the username in the decrypted token and the tenant id to generate the service expired page response.
ja_jp: 復号化されたトークン内のユーザー名とテナント ID を使用して、サービス期限切れページのレスポンスを生成します。

source: Use this JRE definition as your Quarkus project targeted runtime and the workaround will be applied to any "Run as JUnit" configuration.
ja_jp: このJRE定義をQuarkusプロジェクトのターゲットランタイムとして使用すると、「Run as JUnit」設定に回避策が適用されます。

source: Use this attribute to flag special types of content. Valid values: `experimental`, `preview`, `stable` (not usually used), and `deprecated`.
ja_jp: この属性は、特別なタイプのコンテンツにフラグを立てるために使用します。有効な値: `experimental` `preview` , `stable` (通常は使用しない) , `deprecated` .

source: Use this command to deploy to Google Cloud Functions:
ja_jp: このコマンドを使用して、Google Cloud Functions にデプロイします。

source: Use this configuration to automatically create an initial subscription when creating a topic. If this field is not set, the initial subscription is not created.
ja_jp: トピックの作成時に初期サブスクリプションを自動的に作成するには、この設定を使用します。このフィールドが設定されていない場合、初期サブスクリプションは作成されません。

source: Use this token inside the `Authorization` header to trigger OAuth2 authentication.
ja_jp: このトークンを `Authorization` ヘッダ内で使用して、OAuth2 認証を開始します。

source: Use this token to call `/frontend/user-name-with-propagated-token`. This command returns a `200` status code and the name `admin`:
ja_jp: このトークンを使用して `/frontend/user-name-with-propagated-token` を呼び出します。このコマンドは `200` ステータスコードと名前 `admin` を返します。

source: Use this token to call `/frontend/user-name-with-propagated-token`. This command returns the `200` status code and the name `alice`:
ja_jp: このトークンを使用して、 `/frontend/user-name-with-propagated-token` を呼び出します。このコマンドは、 `200` ステータスコードと名前 `alice` を返します。

source: Use those static methods to build your template instances.
ja_jp: テンプレートインスタンスを構築するには、これらの静的メソッドを使用します。

source: Use type reference
ja_jp: 型参照の使用

source: Use virtual thread friendly clients
ja_jp: 仮想スレッドフレンドリーなクライアントの使用

source: Use virtual threads
ja_jp: 仮想スレッドの使用

source: Use virtual threads in REST applications
ja_jp: RESTアプリケーションで仮想スレッドを使用

source: Use whatever dependencies you need as input
ja_jp: 必要な依存関係を入力として使用します。

source: Use worker thread (limit concurrency)
ja_jp: ワーカースレッドを使用 (同時実行に制限)

source: Use xref:config-mappings.adoc#config-mappings[Config Mappings] to group similar configuration properties.
ja_jp: xref:config-mappings.adoc#config-mappings[Config Mappings] を使用して、同様の設定プロパティーをグループ化します。

source: Use xref:https://quarkus.io/guides/dev-services#databases[Dev Services for PostgreSQL] for the integration testing of your application in JVM and native modes.
ja_jp: JVMとネイティブモードでのアプリケーションの統合テストには、 xref:https://quarkus.io/guides/dev-services#databases[Dev Services for PostgreSQL] を使用します。

source: Use xref:security-customization.adoc#security-identity-customization[io.quarkus.security.identity.SecurityIdentityAugmentor] to augment the identity created from the primary ID or access token.
ja_jp: プライマリー ID またはアクセストークンから作成されたアイデンティティーをオーグメントするために、xref:security-customization.adoc#security-identity-customization[io.quarkus.security.identity.SecurityIdentityAugmentor] を使用します。

source: Use xref:security-oidc-code-flow-authentication.adoc#code-flow-oidc-request-filters[quarkus.oidc.common.OidcRequestFilter] to implement a request filter and if necessary, restrict it to the specific OIDC endpoint or endpoints only with the `quarkus.oidc.common.OidcEndpoint` annotation.
ja_jp: リクエストフィルターを実装するには xref:security-oidc-code-flow-authentication.adoc#code-flow-oidc-request-filters[quarkus.oidc.common.OidcRequestFilter] を使用し、必要に応じて、 `quarkus.oidc.common.OidcEndpoint` アノテーションを使用して、特定の OIDC エンドポイントのみに制限してください。

source: Use xref:security-oidc-code-flow-authentication.adoc#code-flow-oidc-response-filters[quarkus.oidc.common.OidcResponseFilter] to implement a response filter and if necessary, restrict it to the specific OIDC endpoint or endpoints only with the `quarkus.oidc.common.OidcEndpoint` annotation.
ja_jp: レスポンスフィルターを実装するには xref:security-oidc-code-flow-authentication.adoc#code-flow-oidc-response-filters[quarkus.oidc.common.OidcResponseFilter] を使用し、必要に応じて、 `quarkus.oidc.common.OidcEndpoint` アノテーションを使用して、特定の OIDC エンドポイントのみに制限してください。

source: Use xref:security-oidc-code-flow-authentication.adoc#oidc-redirect-filters[quarkus.oidc.OidcRedirectFilter] to implement a redirect filter and if necessary, restrict it to the specific OIDC endpoint only with the `quarkus.oidc.Redirect` annotation.
ja_jp: リダイレクトフィルターを実装するには xref:security-oidc-code-flow-authentication.adoc#oidc-redirect-filters[quarkus.oidc.OidcRedirectFilter] を使用し、必要に応じて、 `quarkus.oidc.Redirect` アノテーションを使用して特定の OIDC エンドポイントのみに制限してください。

source: Use xref:security-openid-connect-client-reference.adoc#token-propagation-rest[Quarkus OIDC token propagation feature] if you need to propagate the current bearer or authorization code flow access token to the downstream service. The tokens which must be propagated can be exchanged.
ja_jp: 現在のベアラーまたは認可コードフローのアクセストークンをダウンストリームサービスに伝播する必要がある場合は、 xref:security-openid-connect-client-reference.adoc#token-propagation-rest[Quarkus OIDC トークン伝播機能] を使用してください。伝播する必要のあるトークンを交換することができます。

source: Use: `jbang quarkusapp.java`:
ja_jp: `jbang quarkusapp.java` の利用

source: Used Packages/Classes/Methods Reports
ja_jp: 使用されているパッケージ/クラス/メソッドのレポート

source: Used for resources required at runtime (e.g., SPI service definitions).
ja_jp: 実行時に必要なリソース (SPI サービス定義など) に使用されます。

source: Used in SBOMs with schema versions 1.4 or older. Starting from schema 1.5, `evidence.occurrences.location` is used instead. This property is used only if a component is found in the distribution. The value is a relative path to a file pointing to the location of a component in a distribution using `/` as a path element separator.
ja_jp: スキーマバージョン 1.4 以前の SBOM で使用されます。スキーマ 1.5 以降では、代わりに `evidence.occurrences.location` が使用されます。このプロパティーは、ディストリビューション内にコンポーネントが見つかった場合にのみ使用されます。値は、パス要素の区切り文字として `/` を使用してディストリビューション内のコンポーネントの場所を指すファイルへの相対パスです。

source: Used to identify the location of REST resources (https://tools.ietf.org/html/rfc7230#section-2.7[specification])
ja_jp: REST リソースの場所を特定するために使用 (https://tools.ietf.org/html/rfc7230#section-2.7[specification])

source: Used when runtime configuration needs to be obtained from an external system (like `Consul`), but details of that system need to be configurable (for example Consul's URL). The high level way this works is by using the standard Quarkus config sources (such as properties files, system properties, etc.) and producing `ConfigSourceProvider` objects which are subsequently taken into account by Quarkus when creating the final runtime `Config` object.
ja_jp: ランタイム設定を外部システム (`Consul` など) から取得する必要があるが、そのシステムの詳細は設定可能である必要がある場合 (たとえば Consul の URL) に使用されます。これが機能する高レベルの方法は、標準の Quarkus 設定ソース (プロパティーファイル、システムプロパティーなど) を使用し、最終的なランタイム `Config` オブジェクトを作成するときに Quarkus によって後で考慮される `ConfigSourceProvider` オブジェクトを生成することです。

source: Useful when behind a proxy or in production with known IPs:
ja_jp: プロキシの背後にいる場合や、既知の IP を持つ本番環境で有用です。

source: User Info
ja_jp: ユーザー情報

source: User Marshaller
ja_jp: ユーザマーシャラ

source: User Stories
ja_jp: ユーザーストーリー

source: User `jdoe` has been assigned the role `NoRolesUser`
ja_jp: ユーザー `jdoe` に役割が割り当てられています。 `NoRolesUser`

source: User `jdoe` has password defined as `p4ssw0rd`
ja_jp: ユーザー `jdoe` のパスワードは `p4ssw0rd` と定義されています。

source: User `scott` has been assigned the roles `Admin`, `admin`, `Tester` and `user`
ja_jp: ユーザー `scott` には `Admin`, `admin`, `Tester` および `user`

source: User `scott` has password `jb0ss`
ja_jp: ユーザー `scott` はパスワード `jb0ss` を持っています

source: User `scott` has password defined as `jb0ss`
ja_jp: ユーザー `scott` のパスワードは `jb0ss` と定義されています。

source: User `scott` has roles `Admin`, `admin`, `Tester`, and `user`
ja_jp: ユーザー `scott` には `Admin`, `admin`, `Tester`, および `user`

source: User `stuart` has been assigned the roles `admin` and `user`.
ja_jp: ユーザー `stuart` には `admin` と `user` の役割が割り当てられています。

source: User `stuart` has password `test`
ja_jp: ユーザー `stuart` はパスワード `test` を持っています

source: User `stuart` has roles `admin` and `user`
ja_jp: ユーザー `stuart` には `admin` と `user`

source: User data
ja_jp: ユーザーデータ

source: User defined queries
ja_jp: ユーザー定義のクエリー

source: User info
ja_jp: ユーザー情報

source: User info support
ja_jp: User info サポート

source: User information support
ja_jp: ユーザー情報のサポート

source: User must have resource permission 'Scope Permission Resource' and scope 'read'
ja_jp: ユーザーはリソースパーミッション 'Scope Permission Resource' とスコープ 'read' を持っている必要があります。

source: User must have resource permission `Scope Permission Resource` and scope `read`
ja_jp: ユーザーはリソースパーミッション 'Scope Permission Resource' とスコープ 'read' を持っている必要があります。

source: User name of SOCKS5 proxy.
ja_jp: SOCKS5プロキシのユーザー名。

source: User supplied queries contained in the `@Query` annotation. For example things like the following all work:
ja_jp: `@Query` アノテーションに含まれるユーザー提供のクエリー。たとえば、次のようなものはすべて機能します。

source: User tags can also make use of the template inheritance in the same way as regular `{#include}` sections do.
ja_jp: ユーザータグも、通常の `{#include}` セクションと同じように、テンプレートの継承を利用することができます。

source: User-Initiated Logout
ja_jp: ユーザー主導型ログアウト

source: User-defined Tags
ja_jp: ユーザー定義タグ

source: User-defined tags can be used to include a _tag template_, optionally pass some arguments and possibly override some parts of the template. Let's suppose we have a tag template called `itemDetail.html`:
ja_jp: ユーザー定義タグは、_タグテンプレート_ をインクルードし、オプションでいくつかの引数を渡し、場合によってはテンプレートの一部をオーバーライドするために使用することができます。たとえば、`itemDetail.html` というタグテンプレートがあるとします。

source: User-defined tags can be used to include a tag template and optionally pass some parameters. Let's suppose we have a tag template called `itemDetail.html`:
ja_jp: ユーザー定義タグは、タグテンプレートをインクルードし、オプションでいくつかのパラメーターを渡すために使用できます。 `itemDetail.html` というタグテンプレートがあるとします：

source: UserInfo cache
ja_jp: UserInfo キャッシュ

source: UserInfo path
ja_jp: UserInfo パス

source: UserInfo support
ja_jp: UserInfoサポート

source: Username
ja_jp: ユーザー名

source: Username and password
ja_jp: ユーザー名とパスワード

source: Username: `admin`
ja_jp: ユーザー名: `admin`

source: Username: `alice`
ja_jp: ユーザー名: `alice`

source: Usernames are unique and to your users. Every created WebAuthn credential record has a unique ID.
ja_jp: ユーザー名はユーザーごとに一意です。作成されたすべての WebAuthn 認証情報レコードには一意の ID があります。

source: Usernames, secrets and their roles can be customized with `quarkus.keycloak.devservices.users` (the map which contains usernames and secrets) and `quarkus.keycloak.devservices.roles` (the map which contains user names and comma separated role values).
ja_jp: ユーザー名、シークレット、およびそれらのロールは、 `quarkus.keycloak.devservices.users` (ユーザー名とシークレットを含むマップ) および `quarkus.keycloak.devservices.roles` (ユーザー名とコンマ区切りのロール値を含むマップ) でカスタマイズできます。

source: Usernames, secrets and their roles can be customized with `quarkus.keycloak.devservices.users` (the map which contains usernames and secrets) and `quarkus.keycloak.devservices.roles` (the map which contains usernames and comma separated role values).
ja_jp: ユーザー名、シークレット、およびそれらのロールは、 `quarkus.keycloak.devservices.users` (ユーザー名とシークレットを含むマップ) および `quarkus.keycloak.devservices.roles` (ユーザー名とコンマ区切りのロール値を含むマップ) でカスタマイズできます。

source: Usernames, secrets, and their roles can be customized with `quarkus.keycloak.devservices.users` (the map which contains usernames and secrets) and `quarkus.keycloak.devservices.roles` (the map which contains usernames and comma-separated role values).
ja_jp: ユーザー名、シークレット、およびそれらのロールは、`quarkus.keycloak.devservices.users` (ユーザー名とシークレットを含むマップ) および `quarkus.keycloak.devservices.roles` (ユーザー名とコンマ区切りのロール値を含むマップ) でカスタマイズできます。

source: Users are encouraged to use <<typesafe_templates,Type-safe templates>> that help to organize the templates for a specific JAX-RS resource and enable <<typesafe_expressions,type-safe expressions>> automatically.
ja_jp: ユーザーは、特定のJAX-RSリソースのテンプレートを整理し、自動的に <<typesafe_expressions,タイプセーフ表現>> を有効にするのに役立つ <<typesafe_templates,タイプセーフテンプレート>> を使用することが推奨されます。

source: Users are encouraged to use <<typesafe_templates,Type-safe templates>> that help to organize the templates for a specific Jakarta REST resource and enable <<typesafe_expressions,type-safe expressions>> automatically.
ja_jp: ユーザーは、特定の Jakarta REST リソースのテンプレートを整理し、自動的に <<typesafe_expressions,type-safe expressions>> を有効化できる <<typesafe_templates,Type-safe templates>> を使用することが推奨されます。

source: Users are not limited to the plugins discovered by `quarkus plug list --installable`. Users may install plugins as long as they provide the URL or the Maven coordinates pointing to an executable jar or Java file.
ja_jp: ユーザーは、 `quarkus plug list --installable` で検出されたプラグインに限定されません。 ユーザーは、実行可能な jar または Java ファイルを指す URL または Maven 座標を指定することで、プラグインをインストールできます。

source: Users can add their own Grafana dashboards with their own configuration. Place a `grafana-dashboard-[your name].json` file into the `META-INF/grafana` directory in your application, and LGTM Dev Services will pick it up automatically, and include this dashboard configuration in the overall Grafana dashboards YAML configuration.
ja_jp: ユーザーは独自のGrafanaダッシュボードと独自の構成を追加できます。`grafana-dashboard-[your name].json` ファイルをアプリケーションの `META-INF/grafana` ディレクトリーに配置すると、LGTM Dev Services が自動的にそれを検出し、このダッシュボード構成を全体のGrafanaダッシュボード YAML 構成に含めます。

source: Users can also access the entire SSE event by using the `org.jboss.resteasy.reactive.client.SseEvent` type.
ja_jp: ユーザーは、 `org.jboss.resteasy.reactive.client.SseEvent` 型を使用して、SSE イベント全体にアクセスすることもできます。

source: Users can also throw `jakarta.ws.rs.RedirectionException` from a method body to get Quarkus REST to perform the desired redirect.
ja_jp: ユーザーは、メソッド本体から `jakarta.ws.rs.RedirectionException` を出力して、Quarkus REST に目的のリダイレクトを実行させることもできます。

source: Users can also throw `jakarta.ws.rs.RedirectionException` from a method body to get RESTEasy Reactive to perform the desired redirect.
ja_jp: また、ユーザーはメソッド本体から `jakarta.ws.rs.RedirectionException` を投げることで、RESTEasy Reactive に目的のリダイレクトを実行させることができます。
